package com.company;

import java.util.ArrayList;
import java.util.List;
import java.util.Random;
import java.util.Scanner;

public class Main {

    public static void main(String[] args) {
        /**  Консолдон кызматкерлердин маалыматтарын окуй турган тиркеме түзүңүз.
         * Программа колдонуучудан төмөнкү маалыматтарды сурайт, андан кийин анын жалпы иш тажрыйбасын эсептеп,
         * көрсөтөт.
        аты
                Фамилия
        Туулган жылы
        Жылдын башталышы
        Маалыматтарды киргизүүдө программа төмөнкү өзгөчөлүктөргө жооп бериши керек:
        Атын, фамилиясынын ордуна сандарды киргизүү
        Туулган жылынын жана башталган жылынын ордуна сандык эмес белгилерди киргизүү
        Келечектен туулган жылын жана иш баштаган жылын киргизүү
        Кызматкер 18 жашка толгон жылдан эрте иш баштаган жылды киргизүү */

       Person person = new Person("Ake", "Goliy", -26, 2025);
        System.out.println(person);


    }
}
